DEFINE DATA LOCAL
01 W-NUMBER(N5)  INIT <10>
01 W-OUT  (A50)
END-DEFINE
*
DECIDE ON FIRST VALUE OF W-NUMBER
  VALUES 1 : 3           
	MOVE "VALUE IS EITHER 1, 2 or 3"     TO W-OUT
  VALUES 5               
	MOVE "vVALUE IS 5"             TO W-OUT
  VALUES 7 , 8 , 10     
	 MOVE "VALUE IS EITHER 7, 8 or 10"    TO W-OUT
  VALUES 13, 15 : 18     
	MOVE "VALUE IS 13 OR IN RANGE OF 15 - 18" TO W-OUT
  NONE VALUES            
	MOVE "INVALID VALUE"          TO W-OUT
END-DECIDE
*
DISPLAY W-NUMBER W-OUT
*
END