DEFINE DATA LOCAL
1 CRUISEVIEW VIEW OF CRUISE
  2 START-HARBOR (A20)
1 INPUT-HARBOR (A20)
END-DEFINE
*
R1. REPEAT
  INPUT 'Please enter Value for Start-Harbor:' INPUT-HARBOR
*
  IF INPUT-HARBOR = ' '
    ESCAPE BOTTOM (R1.)
  END-IF
*
  H1. HISTOGRAM CRUISEVIEW START-HARBOR INPUT-HARBOR
  END-HISTOGRAM
  INPUT (AD=O) 'Values found for:' INPUT-HARBOR 'Number:' *NUMBER (H1.) 
*
END-REPEAT
*
END