DEFINE DATA LOCAL
/*
1 CRUISEVIEW VIEW OF CRUISE
  2 CRUISE-ID (N8.0)
  2 CRUISE-STATUS (A1)
  2 CRUISE-START
    3 START-DATE (N8.0)
    3 REDEFINE START-DATE
      4 START-DATEYYYY (N4)
    3 START-TIME (N6.0)
  2 CRUISE-END
    3 END-DATE (N8.0)
    3 REDEFINE END-DATE
      4 END-DATEYYYY (N4)
    3 END-TIME (N6.0)
  2 START-HARBOR (A20)
  2 DESTINATION-HARBOR (A20)
  2 ID-YACHT (N8.0)
  2 PRICES
    3 PRICE-1W (P10.3)
    3 PRICE-2W (P10.3)
    3 PRICE-3W (P10.3)
/*
1 CRUISE2VIEW VIEW OF CRUISE2
  2 CRUISE-ID (N8.0)
  2 CRUISE-STATUS (A1)
  2 CRUISE-START
    3 START-DATE (N8.0)
    3 START-TIME (N6.0)
  2 CRUISE-END
    3 END-DATE (N8.0)
    3 END-TIME (N6.0)
  2 START-HARBOR (A20)
  2 DESTINATION-HARBOR (A20)
  2 ID-YACHT (N8.0)
  2 PRICES
    3 PRICE-1W (P10.3)
    3 PRICE-2W (P10.3)
    3 PRICE-3W (P10.3)
/*) imported data fields from Data Definition Module CRUISE
1 INCYEAR            (N1) CONST<1>
1 INCPRICEPERCENT    (N1) CONST<5>
END-DEFINE
/*
R2. READ CRUISEVIEW BY CRUISE-ID
*
  IF CRUISEVIEW.DESTINATION-HARBOR = "Skiatos"
    MOVE "Naxos" TO CRUISEVIEW.DESTINATION-HARBOR
  END-IF
*
  COMPUTE  CRUISEVIEW.PRICE-1W = CRUISEVIEW.PRICE-1W
    + ( CRUISEVIEW.PRICE-1W * INCPRICEPERCENT  / 100 )
  COMPUTE  CRUISEVIEW.START-DATEYYYY = CRUISEVIEW.START-DATEYYYY
    + INCYEAR
  COMPUTE  CRUISEVIEW.END-DATEYYYY = CRUISEVIEW.END-DATEYYYY
    + INCYEAR
*
  MOVE BY NAME CRUISEVIEW TO CRUISE2VIEW
*
  STORE CRUISE2VIEW
*
END-READ
*
END TRANSACTION
*
END