DEFINE DATA LOCAL
1 MYVIEW VIEW OF EMPLOYEES
  2 NAME
  2 FIRST-NAME
  2 LEAVE-DUE
1 #SUM (N3)  
END-DEFINE
*
INCLUDE AATITLER
INCLUDE AASETC
*
* FIRST, WE WILL READ AND SUM ALL FIVE ALEXANDERS
*
READ MYVIEW BY NAME STARTING FROM 
            'ALEXANDER' TO 'ALEXANDER'
DISPLAY 5T FIRST-NAME LEAVE-DUE 
*
AT END OF DATA
   WRITE / 5T 'SUM OF LEAVE DUE IS:' 
              SUM (LEAVE-DUE) (NL=3)
   END-ENDDATA
END-READ