DEFINE DATA LOCAL
1 #A-DATE(A10)     INIT <'04/02/2020'>
1 #DATE (D)
1 #D-FORMAT (A1)
END-DEFINE
REPEAT
  INPUT #A-DATE(AD=MD)
  DECIDE FOR FIRST CONDITION
    WHEN #A-DATE= MASK (MM'/'DD'/'YYYY)
         ASSIGN #D-FORMAT = 'U'
         MOVE EDITED #A-DATETO #DATE (EM=MM/DD/YYYY)
    WHEN #A-DATE= MASK (DD'-'MM'-'YYYY)
         ASSIGN #D-FORMAT = 'E'
         MOVE EDITED #A-DATETO #DATE (EM=DD-MM-YYYY)
    WHEN #A-DATE= MASK (YYYY/MM/DD)
         ASSIGN #D-FORMAT = 'I'
         MOVE EDITED #A-DATETO #DATE (EM=YYYY/MM/DD)
    WHEN NONE
         REINPUT 'invalid format'
  END-DECIDE
  DISPLAY #A-DATE
          #D-FORMAT
          #DATE
          #DATE (EM=MM/DD/YYYY)
END-REPEAT
END